
## Plan Result (sandbox)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2289617755)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.iam_users[&#34;fuga&#34;].aws_iam_user.this
  * module.iam_users[&#34;hoge&#34;].aws_iam_user.this
  * module.iam_users[&#34;moga&#34;].aws_iam_user.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.iam_users["fuga"].aws_iam_user.this will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "fuga"
      + path          = "/"
      + tags_all      = {
          + "pl:environment" = "sandbox"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-sandbox@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "terraform/environments/sandbox/test-statement"
        }
      + unique_id     = (known after apply)
    }

  # module.iam_users["hoge"].aws_iam_user.this will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "hoge"
      + path          = "/"
      + tags_all      = {
          + "pl:environment" = "sandbox"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-sandbox@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "terraform/environments/sandbox/test-statement"
        }
      + unique_id     = (known after apply)
    }

  # module.iam_users["moga"].aws_iam_user.this will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "moga"
      + path          = "/"
      + tags_all      = {
          + "pl:environment" = "sandbox"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-sandbox@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "terraform/environments/sandbox/test-statement"
        }
      + unique_id     = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":22,"Program":"tfcmt","SHA1":"388b1ac81fcf5bfd6afebd9afe87c77ed0d362f0","Target":"sandbox","Vars":{},"WorkflowName":"Terraform - AWS - Sandbox"} -->